In [4]:
import pandas as pd

data={
    'name':['a','b','c'],
    'sex':[1,0,1],
    'some_num':[1.,2.,3.]
}

df=pd.DataFrame(data)
df

  name  sex  some_num
0    a    1       1.0
1    b    0       2.0
2    c    1       3.0

In [5]:
df[:2]

  name  sex  some_num
0    a    1       1.0
1    b    0       2.0

In [7]:
df[['name','sex']]

  name  sex
0    a    1
1    b    0
2    c    1

In [5]:
vg=pd.read_csv('vgsales.csv')
vg.head(3)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82

In [10]:
vg.shape[0]

16598

In [17]:
vg.shape[1]

11

In [12]:
vg.columns

Index(['Rank', 'Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

In [13]:
vg.head(10)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
5,6,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,0.58,30.26
6,7,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
7,8,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,2.85,29.02
8,9,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
9,10,Duck Hunt,NES,1984.0,Shooter,Nintendo,26.93,0.63,0.28,0.47,28.31

In [14]:
vg.tail(10)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
16588,16591,Mega Brain Boost,DS,2008.0,Puzzle,Majesco Entertainment,0.01,0.00,0.00,0.0,0.01
16589,16592,Chou Ezaru wa Akai Hana: Koi wa Tsuki ni Shiru...,PSV,2016.0,Action,dramatic create,0.00,0.00,0.01,0.0,0.01
16590,16593,Eiyuu Densetsu: Sora no Kiseki Material Collec...,PSP,2007.0,Role-Playing,Falcom Corporation,0.00,0.00,0.01,0.0,0.01
16591,16594,Myst IV: Revelation,PC,2004.0,Adventure,Ubisoft,0.01,0.00,0.00,0.0,0.01
16592,16595,Plushees,DS,2008.0,Simulation,Destineer,0.01,0.00,0.00,0.0,0.01
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.0,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.0,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.0,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.0,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.0,0.01

In [16]:
vg.columns[:5]

Index(['Rank', 'Name', 'Platform', 'Year', 'Genre'], dtype='object')

In [18]:
vg.head(5).Name

0                  Wii Sports
1           Super Mario Bros.
2              Mario Kart Wii
3           Wii Sports Resort
4    Pokemon Red/Pokemon Blue
Name: Name, dtype: object

In [20]:
vg.loc[0]

Rank                     1
Name            Wii Sports
Platform               Wii
Year                2006.0
Genre               Sports
Publisher         Nintendo
NA_Sales             41.49
EU_Sales             29.02
JP_Sales              3.77
Other_Sales           8.46
Global_Sales         82.74
Name: 0, dtype: object

In [25]:
vg.loc[0:10,['Name','Year']]

                         Name    Year
0                  Wii Sports  2006.0
1           Super Mario Bros.  1985.0
2              Mario Kart Wii  2008.0
3           Wii Sports Resort  2009.0
4    Pokemon Red/Pokemon Blue  1996.0
5                      Tetris  1989.0
6       New Super Mario Bros.  2006.0
7                    Wii Play  2006.0
8   New Super Mario Bros. Wii  2009.0
9                   Duck Hunt  1984.0
10                 Nintendogs  2005.0

In [26]:
df.iloc[0]

name          a
sex           1
some_num    1.0
Name: 0, dtype: object

In [32]:
# iloc左闭右闭
vg.iloc[100:110,[1,2]]

                                       Name Platform
100  The Legend of Zelda: Twilight Princess      Wii
101               Call of Duty: Black Ops 3     XOne
102                              Just Dance      Wii
103                           Battlefield 3      PS3
104              Need for Speed Underground      PS2
105                                Tekken 3       PS
106               Crash Bandicoot 3: Warped       PS
107                 Super Smash Bros. Melee       GC
108                            Mario Kart 8     WiiU
109                               Fallout 4      PS4

In [36]:
vg[vg['Name']=='Just Dance']

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
102,103,Just Dance,Wii,2009.0,Misc,Ubisoft,3.51,3.03,0.0,0.73,7.27

In [37]:
vg[vg.Global_Sales>50]

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74

In [54]:
# & | ~
vg.loc[(vg.Year>2000) & (vg.Rank>3),:]

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
6,7,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
7,8,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,2.85,29.02
8,9,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
10,11,Nintendogs,DS,2005.0,Simulation,Nintendo,9.07,11.00,1.93,2.75,24.76
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [39]:
type(vg[vg.Year>2000])

pandas.core.frame.DataFrame

In [40]:
vg[vg.Year>2000].dtypes

Rank              int64
Name             object
Platform         object
Year            float64
Genre            object
Publisher        object
NA_Sales        float64
EU_Sales        float64
JP_Sales        float64
Other_Sales     float64
Global_Sales    float64
dtype: object

In [55]:
vg.loc[(vg.Genre=='Puzzle') & (vg.Year<2000),['Name','Year','Publisher','Global_Sales']]

,Name,Year,Publisher,Global_Sales
5,Tetris,1989.0,Nintendo,30.26
89,Pac-Man,1982.0,Atari,7.81
155,Tetris,1988.0,Nintendo,5.58
170,Dr. Mario,1989.0,Nintendo,5.34
215,Dr. Mario,1990.0,Nintendo,4.85
...,...,...,...,...
13975,Mr. Driller,1999.0,Namco Bandai Games,0.04
14996,Bust-A-Move,1994.0,Micro Cabin,0.02
15035,Shanghai: True Valor,1998.0,Activision,0.02
15168,Super Nazo Puyo Tsuu: Ruruu no Tetsuwan Hanjyouki,1996.0,Compile,0.02
15515,Puzzle Star Sweep,1997.0,Midas Interactive Entertainment,0.02

In [57]:
vg.loc[(vg.Genre=='Puzzle') & (vg.Year<2000)][['Name','Year','Publisher','Global_Sales']]

,Name,Year,Publisher,Global_Sales
5,Tetris,1989.0,Nintendo,30.26
89,Pac-Man,1982.0,Atari,7.81
155,Tetris,1988.0,Nintendo,5.58
170,Dr. Mario,1989.0,Nintendo,5.34
215,Dr. Mario,1990.0,Nintendo,4.85
...,...,...,...,...
13975,Mr. Driller,1999.0,Namco Bandai Games,0.04
14996,Bust-A-Move,1994.0,Micro Cabin,0.02
15035,Shanghai: True Valor,1998.0,Activision,0.02
15168,Super Nazo Puyo Tsuu: Ruruu no Tetsuwan Hanjyouki,1996.0,Compile,0.02
15515,Puzzle Star Sweep,1997.0,Midas Interactive Entertainment,0.02

In [37]:
import numpy as np
#idx=np.where()

vg.query('4<Rank<=80 & Genre=="Sports"')

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,xx
13,14,Wii Fit,Wii,2007.0,Sports,Nintendo,8.94,8.03,3.60,2.15,22.72,0.0
14,15,Wii Fit Plus,Wii,2009.0,Sports,Nintendo,9.09,8.59,2.53,1.79,22.00,0.0
77,78,FIFA 16,PS4,2015.0,Sports,Electronic Arts,1.11,6.06,0.06,1.26,8.49,0.0

In [34]:
vg['xx']=np.zeros(vg.shape[0])
vg.head(10)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,xx
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,0.0
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,0.0
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,0.0
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,0.0
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,0.0
5,6,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,0.58,30.26,0.0
6,7,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01,0.0
7,8,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,2.85,29.02,0.0
8,9,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62,0.0
9,10,Duck Hunt,NES,1984.0,Shooter,Nintendo,26.93,0.63,0.28,0.47,28.31,0.0

In [68]:
df

  name  sex  some_num
0    a    1       1.0
1    b    0       2.0
2    c    1       3.0

In [76]:
# return a new dataframe, original df is inmutable
# df=df.append({'name':'Tom','sex':0,'some_num':np.NaN},ignore_index=True)
# df=df.append({'name':'Tom','sex':0},ignore_index=True)
df=df.append({'name':'Tom','sex':1,'some_num':200.},ignore_index=True)
df

  name  sex  some_num
0    a    1       1.0
1    b    0       2.0
2    c    1       3.0
3  Tom    0     300.0
4  Tom    0       NaN
5  Tom    0       NaN

In [77]:
df['new_col']=np.zeros(df.shape[0])
df

  name  sex  some_num  new_col
0    a    1       1.0      0.0
1    b    0       2.0      0.0
2    c    1       3.0      0.0
3  Tom    0     300.0      0.0
4  Tom    0       NaN      0.0
5  Tom    0       NaN      0.0

In [1]:
import pandas as pd

df=pd.DataFrame({1:[0,0,0,0,0],2:[1,1,1,1,1]})
df

   1  2
0  0  1
1  0  1
2  0  1
3  0  1
4  0  1